bekencorp/bk_avdk_smp/ap/components/avdk_driver/include/soc/bk7259/dpu_struct.h
// Copyright 2022-2025 Beken
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

// This is a generated file, if you need to modify it, use the script to
// generate and modify all the struct.h, ll.h, reg.h, debug_dump.c files!

#pragma once

#ifdef __cplusplus
extern "C" {
#endif


typedef volatile union
{
    struct
    {
        uint32_t product_id                       : 32; /**<bit[0 : 31] */
    };
    uint32_t v;
} dpu_gcregdcproductid_t;


typedef volatile union
{
    struct
    {
        uint32_t format                           :  3; /**<bit[0 : 2] */
        uint32_t enable                           :  1; /**<bit[3 : 3] */
        uint32_t reserved_bit_4_4                 :  1; /**<bit[4 : 4] */
        uint32_t clear_en                         :  1; /**<bit[5 : 5] */
        uint32_t reserved_bit_6_9                 :  4; /**<bit[6 : 9] */
        uint32_t color_key_en                     :  1; /**<bit[10 : 10] */
        uint32_t reserved_bit_11_16               :  6; /**<bit[11 : 16] */
        uint32_t swizzle                          :  2; /**<bit[17 : 18] */
        uint32_t uv_swizzle                       :  1; /**<bit[19 : 19] */
        uint32_t reserved_bit_20_20               :  1; /**<bit[20 : 20] */
        uint32_t dec_mode                         :  3; /**<bit[21 : 23] */
        uint32_t rot_angle                        :  3; /**<bit[24 : 26] */
        uint32_t reserved_bit_27_31               :  5; /**<bit[27 : 31] */
    };
    uint32_t v;
} dpu_gcregframebufferconfig_t;


typedef volatile union
{
    struct
    {
        uint32_t address                          : 32; /**<bit[0 : 31] */
    };
    uint32_t v;
} dpu_gcregframebufferaddress_t;


typedef volatile union
{
    struct
    {
        uint32_t stride                           : 17; /**<bit[0 : 16] */
        uint32_t reserved_bit_17_31               : 15; /**<bit[17 : 31] */
    };
    uint32_t v;
} dpu_gcregframebufferstride_t;


typedef volatile union
{
    struct
    {
        uint32_t tile_format                      :  2; /**<bit[0 : 1] */
        uint32_t yuv_standard                     :  1; /**<bit[2 : 2] */
        uint32_t tile_format1                     :  2; /**<bit[3 : 4] */
        uint32_t reserved_bit_5_31                : 27; /**<bit[5 : 31] */
    };
    uint32_t v;
} dpu_gcregdctileincfg_t;


typedef volatile union
{
    struct
    {
        uint32_t address                          : 32; /**<bit[0 : 31] */
    };
    uint32_t v;
} dpu_gcregdctileuvframebufferadr_t;


typedef volatile union
{
    struct
    {
        uint32_t stride                           : 16; /**<bit[0 : 15] */
        uint32_t reserved_bit_16_31               : 16; /**<bit[16 : 31] */
    };
    uint32_t v;
} dpu_gcregdctileuvframebufferstr_t;


typedef volatile union
{
    struct
    {
        uint32_t blue                             :  8; /**<bit[0 : 7] */
        uint32_t green                            :  8; /**<bit[8 : 15] */
        uint32_t red                              :  8; /**<bit[16 : 23] */
        uint32_t alpha                            :  8; /**<bit[24 : 31] */
    };
    uint32_t v;
} dpu_gcregframebufferbackground_t;


typedef volatile union
{
    struct
    {
        uint32_t blue                             :  8; /**<bit[0 : 7] */
        uint32_t green                            :  8; /**<bit[8 : 15] */
        uint32_t red                              :  8; /**<bit[16 : 23] */
        uint32_t alpha                            :  8; /**<bit[24 : 31] */
    };
    uint32_t v;
} dpu_gcregframebuffercolorkey_t;


typedef volatile union
{
    struct
    {
        uint32_t blue                             :  8; /**<bit[0 : 7] */
        uint32_t green                            :  8; /**<bit[8 : 15] */
        uint32_t red                              :  8; /**<bit[16 : 23] */
        uint32_t alpha                            :  8; /**<bit[24 : 31] */
    };
    uint32_t v;
} dpu_gcregframebuffercolorkeyhigh_t;


typedef volatile union
{
    struct
    {
        uint32_t blue                             :  8; /**<bit[0 : 7] */
        uint32_t green                            :  8; /**<bit[8 : 15] */
        uint32_t red                              :  8; /**<bit[16 : 23] */
        uint32_t alpha                            :  8; /**<bit[24 : 31] */
    };
    uint32_t v;
} dpu_gcregframebufferclearvalue_t;


typedef volatile union
{
    struct
    {
        uint32_t x                                : 12; /**<bit[0 : 11] */
        uint32_t reserved_bit_12_15               :  4; /**<bit[12 : 15] */
        uint32_t y                                : 12; /**<bit[16 : 27] */
        uint32_t reserved_bit_28_31               :  4; /**<bit[28 : 31] */
    };
    uint32_t v;
} dpu_gcregvideotl_t;


typedef volatile union
{
    struct
    {
        uint32_t width                            : 12; /**<bit[0 : 11] */
        uint32_t reserved_bit_12_15               :  4; /**<bit[12 : 15] */
        uint32_t height                           : 12; /**<bit[16 : 27] */
        uint32_t reserved_bit_28_31               :  4; /**<bit[28 : 31] */
    };
    uint32_t v;
} dpu_gcregframebuffersize_t;


typedef volatile union
{
    struct
    {
        uint32_t src_alpha                        :  8; /**<bit[0 : 7] */
        uint32_t dst_alpha                        :  8; /**<bit[8 : 15] */
        uint32_t reserved_bit_16_31               : 16; /**<bit[16 : 31] */
    };
    uint32_t v;
} dpu_gcregvideoglobalalpha_t;


