bekencorp/bk_avdk_smp/ap/components/avdk_driver/include/soc/bk7259/dpu_struct.h
typedef volatile union
{
    struct
    {
        uint32_t src_alpha                        :  8; /**<bit[0 : 7] */
        uint32_t dst_alpha                        :  8; /**<bit[8 : 15] */
        uint32_t reserved_bit_16_31               : 16; /**<bit[16 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlayglobalalpha_t;


typedef volatile union
{
    struct
    {
        uint32_t blue                             :  8; /**<bit[0 : 7] */
        uint32_t green                            :  8; /**<bit[8 : 15] */
        uint32_t red                              :  8; /**<bit[16 : 23] */
        uint32_t alpha                            :  8; /**<bit[24 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlayclearvalue_t;


typedef volatile union
{
    struct
    {
        uint32_t format                           :  3; /**<bit[0 : 2] */
        uint32_t enable                           :  1; /**<bit[3 : 3] */
        uint32_t reserved_bit_4_4                 :  1; /**<bit[4 : 4] */
        uint32_t clear_en                         :  1; /**<bit[5 : 5] */
        uint32_t reserved_bit_6_16                : 11; /**<bit[6 : 16] */
        uint32_t swizzle                          :  2; /**<bit[17 : 18] */
        uint32_t reserved_bit_19_19               :  1; /**<bit[19 : 19] */
        uint32_t color_key_en                     :  1; /**<bit[20 : 20] */
        uint32_t dec_mode                         :  3; /**<bit[21 : 23] */
        uint32_t rot_angle                        :  3; /**<bit[24 : 26] */
        uint32_t reserved_bit_27_31               :  5; /**<bit[27 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlayconfig1_t;


typedef volatile union
{
    struct
    {
        uint32_t address                          : 32; /**<bit[0 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlayaddress1_t;


typedef volatile union
{
    struct
    {
        uint32_t stride                           : 17; /**<bit[0 : 16] */
        uint32_t reserved_bit_17_31               : 15; /**<bit[17 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlaystride1_t;


typedef volatile union
{
    struct
    {
        uint32_t x                                : 12; /**<bit[0 : 11] */
        uint32_t reserved_bit_12_15               :  4; /**<bit[12 : 15] */
        uint32_t y                                : 12; /**<bit[16 : 27] */
        uint32_t reserved_bit_28_31               :  4; /**<bit[28 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlaytl1_t;


typedef volatile union
{
    struct
    {
        uint32_t width                            : 12; /**<bit[0 : 11] */
        uint32_t reserved_bit_12_15               :  4; /**<bit[12 : 15] */
        uint32_t height                           : 12; /**<bit[16 : 27] */
        uint32_t reserved_bit_28_31               :  4; /**<bit[28 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlaysize1_t;


typedef volatile union
{
    struct
    {
        uint32_t blue                             :  8; /**<bit[0 : 7] */
        uint32_t green                            :  8; /**<bit[8 : 15] */
        uint32_t red                              :  8; /**<bit[16 : 23] */
        uint32_t alpha                            :  8; /**<bit[24 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlaycolorkey1_t;


typedef volatile union
{
    struct
    {
        uint32_t blue                             :  8; /**<bit[0 : 7] */
        uint32_t green                            :  8; /**<bit[8 : 15] */
        uint32_t red                              :  8; /**<bit[16 : 23] */
        uint32_t alpha                            :  8; /**<bit[24 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlaycolorkeyhigh1_t;


typedef volatile union
{
    struct
    {
        uint32_t alpha_blend                      :  1; /**<bit[0 : 0] */
        uint32_t src_alpha_mode                   :  1; /**<bit[1 : 1] */
        uint32_t reserved_bit_2_2                 :  1; /**<bit[2 : 2] */
        uint32_t src_global_alpha_mode            :  2; /**<bit[3 : 4] */
        uint32_t reserved_bit_5_5                 :  1; /**<bit[5 : 5] */
        uint32_t src_blending_mode                :  2; /**<bit[6 : 7] */
        uint32_t src_alpha_factor                 :  1; /**<bit[8 : 8] */
        uint32_t dst_alpha_mode                   :  1; /**<bit[9 : 9] */
        uint32_t dst_global_alpha_mode                   :  2; /**<bit[10 : 11] */
        uint32_t reserved_bit_12_12               :  1; /**<bit[12 : 12] */
        uint32_t dst_blending_mode                :  2; /**<bit[13 : 14] */
        uint32_t dst_alpha_factor                 :  1; /**<bit[15 : 15] */
        uint32_t reserved_bit_16_31               : 16; /**<bit[16 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlayalphablendconfig1_t;


typedef volatile union
{
    struct
    {
        uint32_t src_alpha                        :  8; /**<bit[0 : 7] */
        uint32_t dst_alpha                        :  8; /**<bit[8 : 15] */
        uint32_t reserved_bit_16_31               : 16; /**<bit[16 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlayglobalalpha1_t;


typedef volatile union
{
    struct
    {
        uint32_t blue                             :  8; /**<bit[0 : 7] */
        uint32_t green                            :  8; /**<bit[8 : 15] */
        uint32_t red                              :  8; /**<bit[16 : 23] */
        uint32_t alpha                            :  8; /**<bit[24 : 31] */
    };
    uint32_t v;
} dpu_gcregoverlayclearvalue1_t;


typedef volatile union
{
    struct
    {
        uint32_t y0_x0                            :  4; /**<bit[0 : 3] */
        uint32_t y0_x1                            :  4; /**<bit[4 : 7] */
        uint32_t y0_x2                            :  4; /**<bit[8 : 11] */
        uint32_t y0_x3                            :  4; /**<bit[12 : 15] */
        uint32_t y1_x0                            :  4; /**<bit[16 : 19] */
        uint32_t y1_x1                            :  4; /**<bit[20 : 23] */
        uint32_t y1_x2                            :  4; /**<bit[24 : 27] */
        uint32_t y1_x3                            :  4; /**<bit[28 : 31] */
    };
    uint32_t v;
} dpu_gcregdisplaydithertablelow_t;


