bekencorp/bk_avdk_smp/ap/components/avdk_driver/include/soc/bk7259/dpu_struct.h
typedef volatile union
{
    struct
    {
        uint32_t y2_x0                            :  4; /**<bit[0 : 3] */
        uint32_t y2_x1                            :  4; /**<bit[4 : 7] */
        uint32_t y2_x2                            :  4; /**<bit[8 : 11] */
        uint32_t y2_x3                            :  4; /**<bit[12 : 15] */
        uint32_t y3_x0                            :  4; /**<bit[16 : 19] */
        uint32_t y3_x1                            :  4; /**<bit[20 : 23] */
        uint32_t y3_x2                            :  4; /**<bit[24 : 27] */
        uint32_t y3_x3                            :  4; /**<bit[28 : 31] */
    };
    uint32_t v;
} dpu_gcregdisplaydithertablehigh_t;


typedef volatile union
{
    struct
    {
        uint32_t de                               :  1; /**<bit[0 : 0] */
        uint32_t de_polarity                      :  1; /**<bit[1 : 1] */
        uint32_t reserved_bit_2_4                 :  3; /**<bit[2 : 4] */
        uint32_t data_polarity                    :  1; /**<bit[5 : 5] */
        uint32_t reserved_bit_6_7                 :  2; /**<bit[6 : 7] */
        uint32_t clock                            :  1; /**<bit[8 : 8] */
        uint32_t clock_polarity                   :  1; /**<bit[9 : 9] */
        uint32_t reserved_bit_10_31               : 22; /**<bit[10 : 31] */
    };
    uint32_t v;
} dpu_gcregpanelconfig_t;


typedef volatile union
{
    struct
    {
        uint32_t valid                            :  1; /**<bit[0 : 0] */
        uint32_t back_pressure_disab              :  1; /**<bit[1 : 1] */
        uint32_t reserved_bit_2_31                : 30; /**<bit[2 : 31] */
    };
    uint32_t v;
} dpu_gcregpanelcontrol_t;


typedef volatile union
{
    struct
    {
        uint32_t output                           :  1; /**<bit[0 : 0] */
        uint32_t gamma                            :  1; /**<bit[1 : 1] */
        uint32_t dither                           :  1; /**<bit[2 : 2] */
        uint32_t reserved_bit_3_31                : 29; /**<bit[3 : 31] */
    };
    uint32_t v;
} dpu_gcregpanelfunction_t;


typedef volatile union
{
    struct
    {
        uint32_t working                          :  1; /**<bit[0 : 0] */
        uint32_t reserved_bit_1_31                : 31; /**<bit[1 : 31] */
    };
    uint32_t v;
} dpu_gcregpanelworking_t;


typedef volatile union
{
    struct
    {
        uint32_t reserved_bit_0_0                 :  1; /**<bit[0 : 0] */
        uint32_t video_under_flow                 :  1; /**<bit[1 : 1] */
        uint32_t overlay_under_flow               :  1; /**<bit[2 : 2] */
        uint32_t overlay_under_flow1              :  1; /**<bit[3 : 3] */
        uint32_t reserved_bit_4_31                : 28; /**<bit[4 : 31] */
    };
    uint32_t v;
} dpu_gcregpanelstate_t;


typedef volatile union
{
    struct
    {
        uint32_t display_end                      : 13; /**<bit[0 : 12] */
        uint32_t reserved_bit_13_15               :  3; /**<bit[13 : 15] */
        uint32_t total                            : 13; /**<bit[16 : 28] */
        uint32_t reserved_bit_29_31               :  3; /**<bit[29 : 31] */
    };
    uint32_t v;
} dpu_gcreghdisplay_t;


typedef volatile union
{
    struct
    {
        uint32_t start                            : 13; /**<bit[0 : 12] */
        uint32_t reserved_bit_13_15               :  3; /**<bit[13 : 15] */
        uint32_t end                              : 13; /**<bit[16 : 28] */
        uint32_t reserved_bit_29_29               :  1; /**<bit[29 : 29] */
        uint32_t pulse                            :  1; /**<bit[30 : 30] */
        uint32_t polarity                         :  1; /**<bit[31 : 31] */
    };
    uint32_t v;
} dpu_gcreghsync_t;


typedef volatile union
{
    struct
    {
        uint32_t display_end                      : 12; /**<bit[0 : 11] */
        uint32_t reserved_bit_12_15               :  4; /**<bit[12 : 15] */
        uint32_t total                            : 12; /**<bit[16 : 27] */
        uint32_t reserved_bit_28_31               :  4; /**<bit[28 : 31] */
    };
    uint32_t v;
} dpu_gcregvdisplay_t;


typedef volatile union
{
    struct
    {
        uint32_t start                            : 12; /**<bit[0 : 11] */
        uint32_t reserved_bit_12_15               :  4; /**<bit[12 : 15] */
        uint32_t end                              : 12; /**<bit[16 : 27] */
        uint32_t reserved_bit_28_29               :  2; /**<bit[28 : 29] */
        uint32_t pulse                            :  1; /**<bit[30 : 30] */
        uint32_t
        polarity                        :  1; /**<bit[31 : 31] */
    };
    uint32_t v;
} dpu_gcregvsync_t;


typedef volatile union
{
    struct
    {
        uint32_t x                                : 16; /**<bit[0 : 15] */
        uint32_t y                                : 16; /**<bit[16 : 31] */
    };
    uint32_t v;
} dpu_gcregdisplaycurrentlocation_t;


typedef volatile union
{
    struct
    {
        uint32_t index                            :  8; /**<bit[0 : 7] */
        uint32_t reserved_bit_8_31                : 24; /**<bit[8 : 31] */
    };
    uint32_t v;
} dpu_gcreggammaindex_t;


typedef volatile union
{
    struct
    {
        uint32_t blue                             :  8; /**<bit[0 : 7] */
        uint32_t green                            :  8; /**<bit[8 : 15] */
        uint32_t red                              :  8; /**<bit[16 : 23] */
        uint32_t reserved_bit_24_31               :  8; /**<bit[24 : 31] */
    };
    uint32_t v;
} dpu_gcreggammadata_t;


typedef volatile union
{
    struct
    {
        uint32_t format                           :  2; /**<bit[0 : 1] */
        uint32_t reserved_bit_2_7                 :  6; /**<bit[2 : 7] */
        uint32_t hot_spot_y                       :  5; /**<bit[8 : 12] */
        uint32_t reserved_bit_13_15               :  3; /**<bit[13 : 15] */
        uint32_t hot_spot_x                       :  5; /**<bit[16 : 20] */
        uint32_t reserved_bit_21_31               : 11; /**<bit[21 : 31] */
    };
    uint32_t v;
} dpu_gcregcursorconfig_t;


