bekencorp/bk_avdk_smp/ap/components/avdk_driver/include/soc/bk7259/dpu_struct.h
typedef volatile union
{
    struct
    {
        uint32_t address                          : 32; /**<bit[0 : 31] */
    };
    uint32_t v;
} dpu_gcregcursoraddress_t;


typedef volatile union
{
    struct
    {
        uint32_t x                                : 13; /**<bit[0 : 12] */
        uint32_t reserved_bit_13_15               :  3; /**<bit[13 : 15] */
        uint32_t y                                : 12; /**<bit[16 : 27] */
        uint32_t reserved_bit_28_31               :  4; /**<bit[28 : 31] */
    };
    uint32_t v;
} dpu_gcregcursorlocation_t;


typedef volatile union
{
    struct
    {
        uint32_t blue                             :  8; /**<bit[0 : 7] */
        uint32_t green                            :  8; /**<bit[8 : 15] */
        uint32_t red                              :  8; /**<bit[16 : 23] */
        uint32_t reserved_bit_24_31               :  8; /**<bit[24 : 31] */
    };
    uint32_t v;
} dpu_gcregcursorbackground_t;


typedef volatile union
{
    struct
    {
        uint32_t blue                             :  8; /**<bit[0 : 7] */
        uint32_t green                            :  8; /**<bit[8 : 15] */
        uint32_t red                              :  8; /**<bit[16 : 23] */
        uint32_t reserved_bit_24_31               :  8; /**<bit[24 : 31] */
    };
    uint32_t v;
} dpu_gcregcursorforeground_t;


typedef volatile union
{
    struct
    {
        uint32_t disp0                            :  1; /**<bit[0 : 0] */
        uint32_t reserved_bit_1_11                : 11; /**<bit[1 : 11] */
        uint32_t disp0_dbi_cfg_error              :  1; /**<bit[12 : 12] */
        uint32_t reserved_bit_13_28               : 16; /**<bit[13 : 28] */
        uint32_t panel_underflow                  :  1; /**<bit[29 : 29] */
        uint32_t soft_reset_done                  :  1; /**<bit[30 : 30] */
        uint32_t bus_error                        :  1; /**<bit[31 : 31] */
    };
    uint32_t v;
} dpu_gcregdisplayintr_t;


typedef volatile union
{
    struct
    {
        uint32_t disp0                            :  1; /**<bit[0 : 0] */
        uint32_t reserved_bit_1_11                : 11; /**<bit[1 : 11] */
        uint32_t disp0_dbi_cfg_error              :  1; /**<bit[12 : 12] */
        uint32_t reserved_bit_13_28               : 16; /**<bit[13 : 28] */
        uint32_t panel_underflow                  :  1; /**<bit[29 : 29] */
        uint32_t soft_reset_done                  :  1; /**<bit[30 : 30] */
        uint32_t bus_error                        :  1; /**<bit[31 : 31] */
    };
    uint32_t v;
} dpu_gcregdisplayintrenable_t;

typedef volatile struct
{
    volatile dpu_gcregdcproductid_t gcregdcproductid;
    volatile uint32_t rsv_804_808[5];
    volatile dpu_gcregframebufferconfig_t gcregframebufferconfig;
    volatile dpu_gcregframebufferaddress_t gcregframebufferaddress;
    volatile dpu_gcregframebufferstride_t gcregframebufferstride;
    volatile uint32_t rsv_80c_80c[1];
    volatile dpu_gcregdctileincfg_t gcregdctileincfg;
    volatile dpu_gcregdctileuvframebufferadr_t gcregdctileuvframebufferadr;
    volatile dpu_gcregdctileuvframebufferstr_t gcregdctileuvframebufferstr;
    volatile uint32_t rsv_810_815[6];
    volatile dpu_gcregframebufferbackground_t gcregframebufferbackground;
    volatile dpu_gcregframebuffercolorkey_t gcregframebuffercolorkey;
    volatile dpu_gcregframebuffercolorkeyhigh_t gcregframebuffercolorkeyhigh;
    volatile dpu_gcregframebufferclearvalue_t gcregframebufferclearvalue;
    volatile dpu_gcregvideotl_t gcregvideotl;
    volatile dpu_gcregframebuffersize_t gcregframebuffersize;
    volatile dpu_gcregvideoglobalalpha_t gcregvideoglobalalpha;
    volatile dpu_gcregblendstackorder_t gcregblendstackorder;
    volatile dpu_gcregvideoalphablendconfig_t gcregvideoalphablendconfig;
    volatile dpu_gcregoverlayconfig_t gcregoverlayconfig;
    volatile dpu_gcregoverlayaddress_t gcregoverlayaddress;
    volatile dpu_gcregoverlaystride_t gcregoverlaystride;
    volatile dpu_gcregdcoverlaytileincfg_t gcregdcoverlaytileincfg;
    volatile dpu_gcregdctileuvoverlayadr_t gcregdctileuvoverlayadr;
    volatile dpu_gcregdctileuvoverlaystr_t gcregdctileuvoverlaystr;
    volatile dpu_gcregoverlaytl_t gcregoverlaytl;
    volatile dpu_gcregoverlaysize_t gcregoverlaysize;
    volatile dpu_gcregoverlaycolorkey_t gcregoverlaycolorkey;
    volatile dpu_gcregoverlaycolorkeyhigh_t gcregoverlaycolorkeyhigh;
    volatile dpu_gcregoverlayalphablendconfig_t gcregoverlayalphablendconfig;
    volatile dpu_gcregoverlayglobalalpha_t gcregoverlayglobalalpha;
    volatile dpu_gcregoverlayclearvalue_t gcregoverlayclearvalue;
    volatile dpu_gcregoverlayconfig1_t gcregoverlayconfig1;
    volatile dpu_gcregoverlayaddress1_t gcregoverlayaddress1;
    volatile dpu_gcregoverlaystride1_t gcregoverlaystride1;
    volatile dpu_gcregoverlaytl1_t gcregoverlaytl1;
    volatile dpu_gcregoverlaysize1_t gcregoverlaysize1;
    volatile dpu_gcregoverlaycolorkey1_t gcregoverlaycolorkey1;
    volatile dpu_gcregoverlaycolorkeyhigh1_t gcregoverlaycolorkeyhigh1;
    volatile dpu_gcregoverlayalphablendconfig1_t gcregoverlayalphablendconfig1;
    volatile dpu_gcregoverlayglobalalpha1_t gcregoverlayglobalalpha1;
    volatile dpu_gcregoverlayclearvalue1_t gcregoverlayclearvalue1;
    volatile uint32_t rsv_836_837[2];
    volatile dpu_gcregdisplaydithertablelow_t gcregdisplaydithertablelow;
    volatile dpu_gcregdisplaydithertablehigh_t gcregdisplaydithertablehigh;
    volatile dpu_gcregpanelconfig_t gcregpanelconfig;
    volatile dpu_gcregpanelcontrol_t gcregpanelcontrol;
    volatile dpu_gcregpanelfunction_t gcregpanelfunction;
    volatile dpu_gcregpanelworking_t gcregpanelworking;
    volatile dpu_gcregpanelstate_t gcregpanelstate;
    volatile uint32_t rsv_83f_83f[1];
    volatile dpu_gcreghdisplay_t gcreghdisplay;
    volatile dpu_gcreghsync_t gcreghsync;
    volatile uint32_t rsv_842_843[2];
    volatile dpu_gcregvdisplay_t gcregvdisplay;
    volatile dpu_gcregvsync_t gcregvsync;
    volatile dpu_gcregdisplaycurrentlocation_t gcregdisplaycurrentlocation;
    volatile dpu_gcreggammaindex_t gcreggammaindex;
    volatile dpu_gcreggammadata_t gcreggammadata;
    volatile dpu_gcregcursorconfig_t gcregcursorconfig;
    volatile dpu_gcregcursoraddress_t gcregcursoraddress;
    volatile dpu_gcregcursorlocation_t gcregcursorlocation;
    volatile dpu_gcregcursorbackground_t gcregcursorbackground;
    volatile dpu_gcregcursorforeground_t gcregcursorforeground;
    volatile dpu_gcregdisplayintr_t gcregdisplayintr;
    volatile dpu_gcregdisplayintrenable_t gcregdisplayintrenable;
} dpu_hw_t;

#ifdef __cplusplus
}
#endif
